/**
 * 记录主账户打新历史
 * @param 券商
 * @param 打新手数
 * @param 打新类型
 * @param 融资倍数
 * @param 融资利率
 * @param 中签数
 * @param 出售价格
 * @param 出售日期
 * @param 打新手续费
 * @return {{融资倍数: (number), 账户: string, 打新手续费, 打新类型: (string), 融资比例: number, 券商, 出售价格, 中签数, 打新手数: number, 出售日期, 融资利率: number}}
 */
const 记录1 = (
  券商,
  打新手数 = 1,
  打新类型 = 1,
  融资倍数 = 10,
  融资利率 = 0.0398,
  中签数,
  出售价格,
  出售日期,
  打新手续费
) => {
  // 现金打新默认0倍融资
  融资倍数 = 打新类型 ? 融资倍数 : 0;

  return {
    券商,
    打新类型: 打新类型 ? "融资打新" : "现金打新",
    打新手数,
    融资比例: 融资倍数 > 1 ? 1 - 1 / 融资倍数 : 融资倍数 / 1,
    融资倍数,
    融资利率,
    中签数,
    出售价格,
    出售日期,
    打新手续费,
    账户: '主账户'
  };
};

let data = [
  {
    name: "农夫山泉",
    list: [
      记录1("华泰", 500, 1, 33, 0.033, 2, 35.15, "2020/9/8"),
      记录1("老虎", 100, 1, 15, 0.0398, 1, 39, "2020/9/8"),
      记录1("富途", 50, 1, 10, 0.0398, 1, 44.85, "2020/9/7"),
      记录1("东财", 50, 1, 10, 0.0398, 0),
      记录1("华赢", 50, 1, 10, 0.0398, 0),
      记录1("易昇", 50, 1, 10, 0.0398, 1, 34.75, "2020/9/8"),
      记录1("长桥", 30, 1, 10, 0.0398, 0),
      记录1("盈路", 30, 1, 10, 0.05, 0),
      记录1("雪盈", 15, 1, 10, 0.025, 1, 34.5, "2020/9/8"),
      记录1("辉立", 20, 1, 10, 0, 0),
      记录1("佳兆业", 20, 1, 10, 0.045, 0),
      记录1("阿尔法", 1, 1, 10, 0.035, 0),
      记录1("利弗莫尔", 1, 1, 10, 0.035, 0),
      记录1("华盛通", 1, 1, 10, 0.035, 0),
      记录1("富元", 1, 1, 10, 0.035, 0),
      记录1("尊嘉", 1, 1, 10, 0.035, 0),
      记录1("盈立", 1, 1, 10, 0.035, 0),
      记录1("青石", 1, 1, 10, 0.035, 0),
      记录1("有鱼", 1, 0, 0, 0.035, 0),
    ],
  },
  {
    name: "快手-W",
    list: [
      记录1("华泰", 100, 1, 20, 0.0388, 1, 300, "2021/2/5"),
      记录1("老虎", 60, 1, 20, 0.0488, 0),
      记录1("盈立", 80, 1, 20, 0.0388, 0),
      记录1("富途", 20, 1, 10, 0.0398, 1, 330, "2021/2/4"),
      记录1("耀才", 70, 1, 10, 0.0288, 0),
      记录1("艾德", 6, 1, 10, 0.038, 0),
      记录1("辉立", 4, 1, 1, 0, 0, undefined, undefined, 38),
      记录1("富昌", 1, 0, 0, 0, 0),
      记录1("有鱼", 1, 0, 0, 0, 0),
      记录1("恒大", 1, 0, 0, 0, 0),
      记录1("富元", 1, 0, 0, 0, 0),
      记录1("尊嘉", 1, 0, 0, 0, 0),
      记录1("华盛通", 1, 0, 0, 0, 0),
      记录1("华赢", 1, 0, 0, 0, 0),
      记录1("阿尔法", 1, 0, 0, 0, 0),
      记录1("易昇", 1, 0, 0, 0, 0),
      记录1("青石", 1, 0, 0, 0, 0),
    ],
  },
  {
    name: "心通医疗-B",
    list: [
      记录1("辉立", 1, 0, 0, 0, 0),
      记录1("华泰", 1, 0, 0, 0, 0),
      记录1("盈立", 1, 1, 10, 0.0388, 0),
    ],
  },
];
data.reverse();

// console.log(data);
export default data;
